In [2]:
import warnings
warnings.simplefilter('ignore')
import pandas as pd
import sklearn

In [3]:
data_path='./Data/employee_retention.csv'
data=pd.read_csv(data_path)
data.sample(3)

,employee_id,company_id,dept,seniority,salary,join_date,quit_date
13994,654516.0,7,data_science,3,64000.0,2014-02-18,NaN
7097,337371.0,6,customer_service,21,93000.0,2015-07-23,NaN
6900,63505.0,1,data_science,2,79000.0,2013-08-26,2015-08-14

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24702 entries, 0 to 24701
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  24702 non-null  float64
 1   company_id   24702 non-null  int64
 2   dept         24702 non-null  object
 3   seniority    24702 non-null  int64
 4   salary       24702 non-null  float64
 5   join_date    24702 non-null  object
 6   quit_date    13510 non-null  object
dtypes: float64(2), int64(2), object(3)
memory usage: 1.3+ MB

In [8]:
data.describe()

         employee_id    company_id     seniority         salary
count   24702.000000  24702.000000  24702.000000   24702.000000
mean   501604.403530      3.426969     14.127803  138183.345478
std    288909.026101      2.700011      8.089520   76058.184573
min        36.000000      1.000000      1.000000   17000.000000
25%    250133.750000      1.000000      7.000000   79000.000000
50%    500793.000000      2.000000     14.000000  123000.000000
75%    753137.250000      5.000000     21.000000  187000.000000
max    999969.000000     12.000000     99.000000  408000.000000

In [12]:
for col in data.columns:
    uniques=sorted(data[col].unique())
    print('{0:20s}{1:5d}\t'.format(col,len(uniques)),uniques[:5])

employee_id         24702	 [36.0, 70.0, 107.0, 155.0, 157.0]
company_id             12	 [1, 2, 3, 4, 5]
dept                    6	 ['customer_service', 'data_science', 'design', 'engineer', 'marketing']
seniority              31	 [1, 2, 3, 4, 5]
salary                367	 [17000.0, 18000.0, 19000.0, 20000.0, 21000.0]
join_date             995	 ['2011-01-24', '2011-01-25', '2011-01-26', '2011-01-31', '2011-02-01']

TypeError: '<' not supported between instances of 'float' and 'str'

In [7]:
ans=data.groupby('company_id')

In [8]:
ans